developer-guides/life-of-a-tile.md
```mermaid
sequenceDiagram
  %%{init: { 'sequence': {'messageAlign': 'left', 'boxTextMargin': 5} }}%%
  participant map
  participant source_cache
  participant source
  participant ajax
  participant glyph manager
  box rgb(250,250,250) worker
    participant worker
    participant worker_source
    participant worker_tile
    participant bucket
    participant worker_ajax
  end

  map->>source_cache: update(transform)
  source_cache->>source_cache: compute covering<br> tiles
  source_cache->>source: loadTile() for each<br>missing tile
  alt raster_tile_source
    source->>ajax: getImage
    else image_source
    source->>ajax: getImage (once)
    else raster_dem_tile_source
    source->>ajax: getImage()
    source->>worker: loadDEMTile()
    worker->>worker: add 1px buffer
    worker-->>source: DEMData
  else vector_tile_source/geojson_source
    source->>worker: loadTile()
    worker->>worker_source: loadVectorTile()
    alt vector_tile_source
    worker_source->>worker_ajax: getArrayBuffer()
    worker_source->>worker_source: decode pbf
    worker_source->>worker_source: parse vector tile
    else geojson_source
        worker_source->>worker_ajax: getJSON()
        worker_source->>worker_source: geojson-vt parse
        worker_source->>worker_source: getTile()
    end
    worker_source->>worker_tile: parse()
    loop for each "layer family"
        worker_tile->>worker_tile: calculate layout<br>properties
        worker_tile->>worker_tile: createBucket
        worker_tile->>bucket: populate()
        bucket->>bucket: compute triangles<br>needed by GPU<br>for each feature we<br>have data for
        worker_tile->>glyph manager: getGlyphs
        glyph manager->>ajax: Fetch font<br>PBFs
        glyph manager->>glyph manager: TinySDF
        worker_tile->glyph manager: getImages
        glyph manager->>ajax: Fetch icon<br>images
        glyph manager-->>worker_tile: glyph/Image dependencies
        worker_tile->>worker_tile: maybePrepare()
        worker_tile->>worker_tile: create GlyphAtlas
        worker_tile->>worker_tile: create ImageAtlas
        worker_tile->>bucket: addFeatures
        worker_tile->>bucket: performSymbolLayout
        bucket->>bucket: place characters
        bucket->>bucket: compute collision<br/>boxes
        bucket->>bucket: compute triangles<br/>needed by GPU
    end
    worker_tile-->>source: callback(bucket, featureIndex, collision boxes, GlyphAtlas, ImageAtlas)
    source->>source: loadVectorData()<br/>decode response
  end
  source-->>source_cache: Tile
  source_cache-->>source_cache: _backfillDEM()<br/>copy 1px buffer<br/>from neigboring tiles
  source->>source: fire('data', {<br/>dataType: 'source'<br>})
  source->>source_cache:<br>
  source_cache->map:<br>
  map->map: fire('sourcedata')
  map->map: render new frame
```
